_posts/2023-08-24-AI-governance-course-2-risk-of-harm-from-AI-misuse-accident-rogue-AI.html
---
layout: article
title: The likelihood of risks arrising from  misuse, accident, or rogue, agentic AI systems causing harm
tags: AI AI-governace-course
license: true
show_subscribe: false
show_edit_on_github: false
---

<p>
This post is for <a href="https://course.aisafetyfundamentals.com/home/governance?week=2">Week 2: Introduction to potential catastrophic risks from AI</a> of the <a href="https://course.aisafetyfundamentals.com/governance">BlueDot Impact AI Safety Fundamentals: Governance Course</a>.
Each week of the course comprises some readings, a short essay writing task, and a 2-hour group discussion.
This post is <a href="/2023/08/14/AI-governance-course-explainer.html">part of a series</a> that I'm publishing to show my work, document my current thinking on the topics, and better reflect on the group discussion on the topic as I explain <a href="/2023/08/14/AI-governance-course-explainer.html#org8fcce5a">here</a>.
</p>

<div id="outline-container-orgd1bca9a" class="outline-2">
<h2 id="orgd1bca9a">Essay task</h2>
<div class="outline-text-2" id="text-orgd1bca9a">
<p>
<b>Do you think risks arising from misuse, accidents, or rogue, agentic AI systems, are more likely to cause harm? Does this answer change when limiting your time horizon to 5 years, 15 years and 30 years?</b>
</p>

<p>
The scenarios by which AI systems are most likely to cause harm are possibly highly dependent on the time horizon being considered. As AI systems become more capable over the coming 30 years the chances of harm from misuse, accidents, or rogue, agentic AI systems change. Additionally, each of these scenarios may present a different scale of harm meaning that the risk profile of the expected quantity of harm, in a probabilistic sense, also changes with time. {something here}
</p>

<p>
The capability of AI systems seems likely to affect both the chances and magnitude of harm for each scenario. Current AI systems appear capable enough to cause harm by deliberate misuse. Bad actors could use current systems to aid in the development of chemical warfare agents or exert harmful political influence through disinformation, as outlined here. The magnitude and likelihood of deliberate misuse seem likely to increase with the developing capabilities of AI systems. The same argument holds for harm caused by accident as if someone can deliberately cause harm then the same harm can likely occur by accident. An example of this would be the accidental release of a toxic chemical discovered by an AI drug creation system for the 2022 publication mentioned in Hendrycks et al. (2023). AI systems are only going to become more capable over the coming 30 years meaning the chances and magnitude of harm caused by both misuse and accident will increase over time.
</p>

<p>
The relative magnitude of harm by misuse or accident seems to be comparable but the chances of harm occurring are different. Harm could be more likely to be caused by accident than misuse at any point in time. As cutting-edge AI systems are being developed accidental harm can occur while the capabilities of systems are being explored. This risk seems likely to increase over time as capabilities increase.
</p>

<p>
It is not clear that this risk posed by rogue, agentic AI systems is functionally different from accidental harm or harm by misuse as a distinct scenario. Presumably, a rogue AI system that is causing harm is an accidental, unforeseen outcome or the intended outcome from a bad actor seeking to misuse AI to cause harm. However, the chances of harm from rogue, agentic AI systems seem low at present compared to relatively 'dumb' AI systems that are not rogue or agentic causing harm. The likelihood of a rogue AI causing harm seems likely to increase over time, however, and would be a more likely cause of harm in 30 years compared to in 5 years. The scale of harm that could be caused by a rogue AI could be much larger than 'dumb' systems causing harm through misuse or accident.
</p>

<p>
To conclude, harm seems most likely to be caused by deliberate misuse at present. As capabilities increase over time the likelihood of harm from accidents could increase and surpass the chances of harm from misuse as the capabilities of cutting-edge AI systems are explored. Rogue, agentic AI systems, as a risk scenario, is functionally similar to the risk of accidental harm or harm by misuse caused by cutting-edge systems and the chances of harm are much higher 30 years from now than at present.
</p>

<p>
<i><a href="/2023/08/14/AI-governance-course-explainer.html#org45001ca">Essay task disclaimer</a></i>
</p>
</div>
</div>

<div id="outline-container-org3ec7818" class="outline-2">
<h2 id="org3ec7818">Group discussion</h2>
<div class="outline-text-2" id="text-org3ec7818">
</div>
<div id="outline-container-orga867e60" class="outline-3">
<h3 id="orga867e60">Misc. notes</h3>
<div class="outline-text-3" id="text-orga867e60">
<ul class="org-ul">
<li>Current examples of near-miss type AI events
<ul class="org-ul">
<li>There's a history of 'narrow' AI systems failing in bad ways, for example the Boeing 737 max navigation system</li>
</ul></li>
<li>Will the current paradigm progress to AGI?
<ul class="org-ul">
<li>We haven't reached any of the bio-anchors for compute yet &#x2013; there could still be a lot yet to come between now and having systems at that level of compute</li>
</ul></li>
<li>Prosaic methods of alignment
<ul class="org-ul">
<li>methods that work for current systems to create alignment</li>
<li>works on the assumption that future systems can be aligned in the same way as current systems and there won’t be a paradigm shit that breaks this</li>
</ul></li>
<li>Scalable oversight
<ul class="org-ul">
<li>trying to keep humans in the loop even past the point where it’s impractical</li>
<li>incrementally smaller models with the smallest of the model being the one a human checks</li>
</ul></li>
<li>Italy has declared that data of Italian citizens has to be stored on Itialian soil
<ul class="org-ul">
<li>affects how AI companies can handle their data</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org480ac25" class="outline-3">
<h3 id="org480ac25">Further reading</h3>
<div class="outline-text-3" id="text-org480ac25">
<ul class="org-ul">
<li><a href="https://causalincentives.com/pdfs/deception-ward-2023.pdf">https://causalincentives.com/pdfs/deception-ward-2023.pdf</a> &#x2013; how to proce deception of agents</li>
<li><a href="https://open.spotify.com/episode/6LIvveCOxqL90STeWbZNI2?si=d369164ba6414599">Podcast from Making Sense with Sam Harris on information integrity</a>
<ul class="org-ul">
<li>I've since listened to the first half of this (what available on the free feed) and I think I want to subscribe to the full feed to hear the rest of it</li>
</ul></li>
</ul>


<hr />
</div>
</div>
</div>

<div id="outline-container-orgb296208" class="outline-2">
<h2 id="orgb296208">Read more</h2>
<div class="outline-text-2" id="text-orgb296208">
<p>
You can <a href="/2023/08/14/AI-governance-course-explainer.html#org2bf5124">view the rest of the series here</a> or <a href="/archive.html?tag=AI-governace-course">view any other posts related to the course here</a>.
</p>
</div>
</div>
